Repository: Atomic002/Tdm-Training
Catalog: lib/l10n/app_*.arb
Languages: ru, uz

source: Loading...
ru: Загрузка...
uz: Yuklanmoqda...

# improveReaction
source: Improve your reaction speed
ru: Улучшите скорость реакции
uz: Reaction tezligingizni oshiring

source: Test account
ru: Тест аккаунт
uz: Test akkaunt

# testAccountWarning
source: UC will not be given to test account and you cannot use it permanently
ru: на тест аккаунт UC не начисляется и постоянно использовать нельзя
uz: test accountga uc berilmaydi va doimiy bu accountdan foydalanib bulmidi

# testAccountCredentials
source: Email: testaccount@test.com Password: 12345678
ru: Email: testaccount@test.com Пароль: 12345678
uz: Email: testaccount@test.com Parol: 12345678

source: Password
ru: Пароль
uz: Parol

source: Name
ru: Имя
uz: Ism

source: Confirm password
ru: Подтвердите пароль
uz: Parolni tasdiqlang

source: Nickname
ru: Никнейм

source: Enter email
ru: Введите email
uz: Email kiriting

# enterValidEmail
source: Enter a valid email
ru: Введите корректный email
uz: To'g'ri email kiriting

source: Enter password
ru: Введите пароль
uz: Parol kiriting

# passwordMinLength
source: Password must be at least 6 characters
ru: Пароль должен содержать минимум 6 символов
uz: Parol kamida 6 ta belgidan iborat bo'lishi kerak

source: Enter name
ru: Введите имя
uz: Ism kiriting

# nameMinLength
source: Name must be at least 2 characters
ru: Имя должно содержать минимум 2 символа
uz: Ism kamida 2 ta belgidan iborat bo'lishi kerak

# confirmPasswordHint
source: Confirm password
ru: Подтвердите пароль
uz: Parolni tasdiqlang

# passwordsNotMatch
source: Passwords do not match
ru: Пароли не совпадают
uz: Parollar mos kelmayapti

# login
source: Sign In
ru: Войти
uz: Kirish

source: or
ru: или
uz: yoki

source: Sign in with Google
ru: Войти через Google
uz: Google bilan kirish

# noAccount
source: Don't have an account?
ru: Нет аккаунта?
uz: Akkauntingiz yo'qmi?

source: Register
ru: Регистрация
uz: Ro'yxatdan o'tish

# createNewAccount
source: Create a new account
ru: Создайте новый аккаунт
uz: Yangi akkaunt yarating

# haveAccount
source: Already have an account?
ru: Уже есть аккаунт?
uz: Akkauntingiz bormi?

# termsAgreement
source: By continuing, you agree to the terms of use
ru: Продолжая, вы соглашаетесь с условиями использования
uz: Davom etish orqali foydalanish shartlariga rozilik bildirasiz

source: Login error
ru: Ошибка входа
uz: Kirish xatoligi

source: User not found
ru: Пользователь не найден
uz: Foydalanuvchi topilmadi

source: Wrong password
ru: Неверный пароль
uz: Parol noto'g'ri

# invalidEmail
source: Invalid email format
ru: Неверный формат email
uz: Email formati noto'g'ri

# invalidCredential
source: Invalid email or password
ru: Неверный email или пароль
uz: Email yoki parol noto'g'ri

# registerError
source: Registration error
ru: Ошибка при регистрации
uz: Ro'yxatdan o'tishda xatolik yuz berdi

# emailAlreadyInUse
source: This email is already registered
ru: Этот email уже зарегистрирован
uz: Bu email allaqachon ro'yxatdan o'tgan

# weakPassword
source: Password is too weak
ru: Слишком слабый пароль
uz: Parol juda zaif

# loginErrorWithDetails
source: Login error: {error}
ru: Ошибка входа: {error}
uz: Kirish xatoligi: {error}

# noInternet
source: No internet connection!
ru: Нет подключения к интернету!
uz: Internetga ulanmagansiz!

# noInternetDesc
source: Please connect to the internet and try again.
ru: Пожалуйста, подключитесь к интернету и попробуйте снова.
uz: Iltimos, internetga ulanib qayta urinib ko'ring.

source: Retry
ru: Повторить
uz: Qayta urinish

source: Coins
ru: Монеты
uz: Coinlar

source: Total UC
ru: Всего UC
uz: Jami UC

source: START
ru: НАЧАТЬ
uz: BOSHLASH

# startSubtitle
source: Play Reaction Training
ru: Играть Reaction Training
uz: Reaction training o'ynash

# coinsMenu
source: COINS
ru: МОНЕТЫ
uz: COINLAR

# coinsMenuSubtitle
source: Collect coins and exchange for UC
ru: Собирать монеты и обменивать на UC
uz: Coin yig'ish va UC almashish

source: UC SHOP
ru: МАГАЗИН UC
uz: UC DO'KONI

# ucShopSubtitle
source: Buy UC (with real money)
ru: Купить UC (за сумы)
uz: UC sotib olish (so'm bilan)

source: TASKS
ru: ЗАДАНИЯ
uz: VAZIFALAR

# tasksSubtitle
source: Complete tasks — earn coins
ru: Выполняйте задания — получайте монеты
uz: Vazifa bajaring — coin oling

source: MINI PUBG
ru: МИНИ PUBG

# miniPubgSubtitle
source: Destroy enemies and earn coins
ru: Уничтожайте врагов и получайте монеты
uz: Dushmanlarni yo'q qiling va coin oling

source: LEADERBOARD
ru: РЕЙТИНГ
uz: REYTING

# leaderboardSubtitle
source: Top players ranking
ru: Рейтинг лучших игроков
uz: Top o'yinchilar reytingi

source: STATISTICS
ru: СТАТИСТИКА
uz: STATISTIKA

# statisticsSubtitle
source: View your results
ru: Просмотр результатов
uz: Natijalaringizni ko'ring

source: SETTINGS
ru: НАСТРОЙКИ
uz: SOZLAMALAR

# settingsSubtitle
source: Game settings
ru: Настройки игры
uz: O'yin sozlamalari

source: ADMIN PANEL
ru: АДМИН ПАНЕЛЬ

# adminPanelSubtitle
source: Users and settings
ru: Пользователи и настройки
uz: Foydalanuvchilar va sozlamalar

source: NEWS
ru: НОВОСТИ
uz: YANGILIKLAR

source: Close
ru: Закрыть
uz: Yopish

# dataLoadError
source: Error loading data
ru: Ошибка при загрузке данных
uz: Ma'lumotlarni yuklashda xatolik yuz berdi

# settingsTitle
source: Settings
ru: Настройки
uz: Sozlamalar

# statsLabel
source: Statistics
ru: Статистика
uz: Statistika

source: Streak
ru: Серия

# streakDays
source: {count} days
ru: {count} дн.
uz: {count} kun

source: Total
ru: Всего
uz: Jami

source: Referral Code
ru: Реферальный код
uz: Taklif Kodi

source: Your code:
ru: Ваш код:
uz: Sizning kodingiz:

# referralCount
source: {count} referrals
ru: {count} приглашений
uz: {count} ta taklif

source: Code copied!
ru: Код скопирован!
uz: Kod nusxalandi!

# version
source: Version 2.0.0
ru: Версия 2.0.0
uz: Versiya 2.0.0

# copyright
source: © 2025 TDM Training. All rights reserved.
ru: © 2025 TDM Training. Все права защищены.
uz: © 2025 TDM Training. Barcha huquqlar himoyalangan.

source: Logout
ru: Выйти
uz: Chiqish

# logoutConfirm
source: Do you want to log out?
ru: Вы хотите выйти из аккаунта?
uz: Hisobdan chiqishni xohlaysizmi?

source: Cancel
ru: Отмена
uz: Bekor qilish

# adLoading
source: Loading ad...
ru: Загрузка рекламы...
uz: Reklama yuklanmoqda...

# skipAd
source: Skip
ru: Пропустить
uz: O'tkazib yuborish

source: User
ru: Пользователь
uz: Foydalanuvchi

# difficultyTitle
source: Difficulty Level
ru: Уровень сложности
uz: Qiyinlik Darajasi

# selectDifficulty
source: Select difficulty level
ru: Выберите уровень сложности
uz: Qiyinlik darajasini tanlang

# difficultyInfo
source: Each level has its own difficulty
ru: Каждый уровень имеет свою сложность
uz: Har bir daraja o'ziga xos qiyinchilikka ega

source: Target time:
ru: Время цели:
uz: Nishon vaqti:

source: Target size:
ru: Размер цели:
uz: Nishon hajmi:

source: Score multiplier:
ru: Множитель очков:
uz: Ball ko'paytiruvchi:

source: Moving targets:
ru: Движущиеся цели:
uz: Harakat qiluvchi nishonlar:

source: Multiple targets:
ru: Несколько целей:
uz: Ko'p nishonlar:

source: Yes
ru: Да
uz: Ha

# diffEasy
source: EASY
ru: ЛЕГКО
uz: OSON

# diffMedium
source: MEDIUM
ru: СРЕДНЕ
uz: O'RTA

# diffHard
source: HARD
ru: СЛОЖНО
uz: QIYIN

# diffExpert
source: EXPERT
ru: ЭКСПЕРТ
uz: EKSPERT

# diffEasyDesc
source: For beginners
ru: Для начинающих
uz: Yangi boshlovchilar uchun

# diffMediumDesc
source: For intermediate players
ru: Для игроков среднего уровня
uz: O'rta daraja o'yinchilar uchun

# diffHardDesc
source: For experienced players
ru: Для опытных игроков
uz: Tajribali o'yinchilar uchun

# diffExpertDesc
source: For professional players
ru: Для профессиональных игроков
uz: Professional o'yinchilar uchun

# coinsAndUC
source: Your Coins and UC
ru: Ваши монеты и UC
uz: Coinlaringiz va UC

source: Daily Status
ru: Дневной статус
uz: Kunlik Status

source: Games
ru: Игры
uz: O'yinlar

source: Ads
ru: Реклама
uz: Reklamalar

source: Earn Coins
ru: Заработать монеты
uz: Coin Topish

source: Watch Ad
ru: Смотреть рекламу
uz: Reklama Ko'rish

# adRewardInfo
source: {coins} coins per ad
ru: {coins} монет за каждую рекламу
uz: Har bir reklama uchun {coins} coin

# adLimitReached
source: Limit reached
ru: Лимит исчерпан
uz: Limit tugadi

# gameEarnInfo
source: You can also earn coins by playing! You'll get 0-10 coins based on your accuracy.
ru: Вы также можете заработать монеты играя! В зависимости от точности получите 0-10 монет.
uz: O'yin o'ynab ham coin olishingiz mumkin! Aniqligingizga qarab 0-10 coin olasiz.

source: UC Exchange
ru: Обмен на UC
uz: UC Almashtirish

source: Exchange UC
ru: Обменять UC
uz: UC Almashish

source: Not enough
ru: Недостаточно
uz: Yetarli emas

source: Recent Exchanges
ru: Последние обмены
uz: So'nggi Almashtirish

# exchangeHistoryEmpty
source: Exchange history is empty
ru: История обменов пуста
uz: Almashtirish tarixi bo'sh

# statusPending
source: Pending
ru: Ожидает
uz: Kutilmoqda

# statusApproved
source: Approved
ru: Подтверждено
uz: Tasdiqlangan

# statusRejected
source: Rejected
ru: Отклонено
uz: Rad etilgan

# statusCompleted
source: Completed
ru: Завершено
uz: Tugallandi

# available
source: Available: {coins} coins
ru: Доступно: {coins} монет
uz: Mavjud: {coins} coin

source: Select exchange amount:
ru: Выберите сумму обмена:
uz: Almashtirish miqdorini tanlang:

# enterYourInfo
source: Enter your information:
ru: Введите ваши данные:
uz: Ma'lumotlaringizni kiriting:

source: Exchange
ru: Обменять
uz: Almashish

# selectExchangeAmountError
source: Please select an exchange amount
ru: Пожалуйста, выберите сумму обмена
uz: Iltimos, almashtirish miqdorini tanlang

# enterNickname
source: Please enter nickname
ru: Пожалуйста, введите никнейм
uz: Iltimos, nickname kiriting

# enterPubgId
source: Please enter PUBG ID
ru: Пожалуйста, введите PUBG ID
uz: Iltimos, PUBG ID kiriting

source: Not enough coins
ru: Недостаточно монет
uz: Yetarli coin yo'q

source: Exchange failed
ru: Обмен не удался
uz: Almashtirish muvaffaqiyatsiz

# errorOccurred
source: An error occurred: {error}
ru: Произошла ошибка: {error}
uz: Xatolik yuz berdi: {error}

source: Success!
ru: Успешно!
uz: Muvaffaqiyatli!

source: UC exchange request accepted!
ru: Запрос на обмен UC принят!
uz: UC almashtirish so'rovi qabul qilindi!

# info
source: Information:
ru: Данные:
uz: Ma'lumotlar:

# amount
source: Amount: {coins} Coins → {uc} UC
ru: Количество: {coins} Монет → {uc} UC
uz: Miqdor: {coins} Coin → {uc} UC

# adminReviewNote
source: The request will be reviewed by admin. UC will be credited after confirmation.
ru: Запрос будет рассмотрен администратором. UC будут зачислены после подтверждения.
uz: So'rov admin tomonidan ko'rib chiqiladi. UC lar tasdiqlangandan so'ng hisobingizga o'tkaziladi.

# adAlreadyLoading
source: Ad is already loading
ru: Реклама уже загружается
uz: Reklama allaqachon yuklanmoqda

# adLimitReachedToday
source: You've reached today's ad limit
ru: Достигнут дневной лимит рекламы
uz: Bugun reklamalar limitiga yetdingiz

# pleaseWait
source: Please wait {time}
ru: Пожалуйста, подождите {time}
uz: Iltimos {time} kuting

# coinsAdded
source: {coins} coins added!
ru: {coins} монет добавлено!
uz: {coins} coin qo'shildi!

# coinAddError
source: Error adding coins
ru: Ошибка при добавлении монет
uz: Coin qo'shishda xatolik yuz berdi

# adShowError
source: Error showing ad
ru: Ошибка при показе рекламы
uz: Reklama ko'rsatishda xatolik yuz berdi

# adShowErrorWithDetails
source: Ad error: {error}
ru: Ошибка рекламы: {error}
uz: Reklama ko'rsatishda xatolik: {error}

# yourRank
source: Your rank: #{rank}
ru: Ваше место: #{rank}
uz: Sizning o'rningiz: #{rank}

source: No data yet
ru: Данных пока нет
uz: Hali ma'lumot yo'q

source: You
ru: Вы
uz: Siz

# overallStats
source: Overall Statistics
ru: Общая статистика
uz: Umumiy statistika

source: Overall
ru: Общее
uz: Umumiy

source: Results
ru: Результаты
uz: Natijalar

source: Levels
ru: Уровни
uz: Darajalar

source: Best Score
ru: Лучший счет
uz: Eng yuqori ball

source: Average Score
ru: Средний счет
uz: O'rtacha ball

source: Games Played
ru: Сыграно игр
uz: O'ynagan o'yinlar

source: Average Accuracy
ru: Средняя точность
uz: O'rtacha aniqlik

# detailedInfo
source: Detailed Information
ru: Подробная информация
uz: Batafsil ma'lumot

source: Total hits:
ru: Всего попаданий:
uz: Jami tushganlar:

source: Total misses:
ru: Всего промахов:
uz: Jami o'tkazilganlar:

source: Total shots:
ru: Всего выстрелов:
uz: Jami o'qlar:

source: Best result:
ru: Лучший результат:
uz: Eng yaxshi natija:

source: Score:
ru: Счет:
uz: Ball:

source: Accuracy:
ru: Точность:
uz: Aniqlik:

source: Date:
ru: Дата:
uz: Sana:

# clearStats
source: Clear Statistics
ru: Очистить статистику
uz: Statistikani tozalash

# statsCleared
source: Statistics cleared
ru: Статистика очищена
uz: Statistika tozalandi

source: No results yet
ru: Результатов пока нет
uz: Hali natijalar yo'q

# playToCollect
source: Play games to collect results!
ru: Играйте, чтобы собрать результаты!
uz: O'yin o'ynab natijalar yig'ing!

# hits
source: Hits: {hits}/{total}
ru: Попадания: {hits}/{total}
uz: Tushgan: {hits}/{total}

# gamesPlayedCount
source: {count} games played
ru: {count} игр сыграно
uz: {count} o'yin o'ynalgan

source: Best
ru: Лучший
uz: Eng yaxshi

# notPlayedYet
source: Not played at this level yet
ru: На этом уровне ещё не играли
uz: Bu darajada hali o'ynalmagan

# clearStatsConfirm
source: All results and statistics will be deleted. This action cannot be undone.
ru: Все результаты и статистика будут удалены. Это действие нельзя отменить.
uz: Barcha natijalar va statistikalar o'chiriladi. Bu amalni qaytarib bo'lmaydi.

source: Clear
ru: Очистить
uz: Tozalash

# adLoadingText
source: Loading ad...
ru: Загрузка рекламы...
uz: Reklama yuklanmoqda...

# adLoadFailed
source: Ad failed to load
ru: Реклама не загрузилась
uz: Reklama yuklanmadi

# startGame
source: START
ru: СТАРТ

source: Ready to play
ru: Готов к игре
uz: O'yinga tayyor

source: Match #{number}
ru: Матч #{number}

source: Game duration
ru: Длительность игры
uz: O'yin davomiyligi

# targetSizeLabel
source: Target size
ru: Размер цели
uz: Nishon hajmi

# rewardLabel
source: Reward
ru: Награда
uz: Mukofot

# upToCoins
source: up to {coins} coins
ru: до {coins} монет
uz: {coins} gacha coin

source: Level
ru: Уровень

source: Lives
ru: Жизни
uz: Jonlar

source: Reward
ru: Награда
uz: Mukofot

# remainingGames
source: Games left
ru: Осталось игр
uz: Qolgan o'yinlar

source: Language
ru: Язык
uz: Til

source: Select language
ru: Выберите язык
uz: Tilni tanlang

source: Total users
ru: Всего юзеров
uz: Jami userlar

source: Active today
ru: Активных сегодня
uz: Bugun faol

source: Pending
ru: Ожидает
uz: Kutilmoqda

source: Users
ru: Пользователи
uz: Foydalanuvchilar

# usersSubtitle
source: View and manage all users
ru: Просмотр и управление пользователями
uz: Barcha userlarni ko'rish va boshqarish

# tasksAdmin
source: Tasks
ru: Задания
uz: Vazifalar

# tasksAdminSubtitle
source: Add and manage tasks
ru: Добавление и управление заданиями
uz: Vazifalarni qo'shish va boshqarish

source: UC Requests
ru: Запросы UC
uz: UC so'rovlar

# ucRequestsSubtitle
source: {count} pending requests
ru: {count} ожидающих запросов
uz: {count} ta kutilayotgan so'rov

source: Announcements
ru: Объявления
uz: E'lonlar

# announcementsSubtitle
source: Manage news and announcements
ru: Управление новостями и объявлениями
uz: Yangiliklar va e'lonlarni boshqarish

source: UC Orders
ru: Заказы UC
uz: UC Buyurtmalar

# ucOrdersSubtitle
source: UC purchase orders
ru: Заказы на покупку UC
uz: UC sotib olish buyurtmalari

# settingsAdmin
source: Settings
ru: Настройки
uz: Sozlamalar

# settingsAdminSubtitle
source: Telegram, Instagram, limits
ru: Telegram, Instagram, лимиты
uz: Telegram, Instagram, limitlar

# notLoggedIn
source: Not logged in! Please sign in again
ru: Вы не авторизованы! Пожалуйста, войдите заново
uz: Login qilmagan! Iltimos qaytadan kiriting

# taskWarning
source: Warning: Your subscription (or completed task) is verified by administrators. If you cheat, 2x coins will be deducted from your account.
ru: Предупреждение: Ваша подписка (или выполненное задание) проверяется администраторами. Если вы обманете, с вашего аккаунта будет списано в 2 раза больше монет.
uz: Ogohlantirish: Sizning obunangiz (yoki bajarilgan vazifa) adminlar tomonidan tekshiriladi. Agar 'bajardim/obuna bo'ldim' deb aldasangiz, hisobingizdan 2 baravar coin yechib olinadi.

source: Verification Code
ru: Код подтверждения
uz: Tasdiqlash Kodi

# step1TelegramId
source: Step 1: Enter Telegram ID
ru: Шаг 1: Введите Telegram ID
uz: 1-qadam: Telegram ID kiriting

source: How to get Telegram ID?
ru: Как узнать Telegram ID?
uz: Telegram ID qanday olish?

# telegramIdInstructions
source: 1. Go to bot: @your_bot_name 2. Send /myid command 3. Copy the ID
ru: 1. Перейдите к боту: @your_bot_name 2. Отправьте команду /myid 3. Скопируйте ID
uz: 1. Botga o'ting: @your_bot_name 2. /myid buyrug'ini yuboring 3. ID ni nusxalang

source: Open bot →
ru: Открыть бота →
uz: Botni ochish →

source: Telegram ID confirmed!
ru: Telegram ID подтверждён!
uz: Telegram ID tasdiqlandi!

# step2EnterCode
source: Step 2: Enter the code from bot
ru: Шаг 2: Введите код от бота
uz: 2-qadam: Botdan kelgan kodni kiriting

# whereToGetCode
source: Where to get the code?
ru: Где взять код?
uz: Kodni qayerdan olish?

# codeInstructions
source: 1. Send /code command to bot 2. Bot will send you a 4-digit code 3. Enter the code here
ru: 1. Отправьте боту команду /code 2. Бот отправит вам 4-значный код 3. Введите код здесь
uz: 1. Botga /code buyrug'ini yuboring 2. Bot sizga 4 xonali kod yuboradi 3. Kodni bu yerga kiriting

# coinReward
source: +{reward} coins reward
ru: +{reward} монет получите
uz: +{reward} coin olasiz

source: Next
ru: Далее
uz: Keyingi

source: Verify
ru: Подтвердить
uz: Tasdiqlash

# coinEarned
source: +{reward} coins earned!
ru: +{reward} монет получено!
uz: +{reward} coin oldiniz!

# taskAlreadyCompleted
source: This task has already been completed today
ru: Это задание уже выполнено сегодня
uz: Bu vazifa bugun allaqachon bajarilgan

# telegramVerify
source: Telegram Verification
ru: Проверка Telegram
uz: Telegram Tekshirish

# enterTelegramIdLabel
source: Enter Telegram ID:
ru: Введите Telegram ID:
uz: Telegram ID kiriting:

# telegramIdInstructions2
source: 1. Write to @userinfobot in Telegram 2. Press /start 3. Copy the number from "Id:" line
ru: 1. Напишите @userinfobot в Telegram 2. Нажмите /start 3. Скопируйте число из строки "Id:"
uz: 1. Telegram'da @userinfobot ga yozing 2. /start bosing 3. "Id:" qatoridagi raqamni nusxalang

source: Open @userinfobot →
ru: Открыть @userinfobot →
uz: @userinfobot ochish →

source: Check
ru: Проверить
uz: Tekshirish

# subscriptionNotFound
source: Subscription not found! Subscribe to the channel and try again.
ru: Подписка не найдена! Подпишитесь на канал и попробуйте снова.
uz: Obuna topilmadi! Kanalga obuna bo'ling va qaytadan urinib ko'ring.

source: Telegram Channel
ru: Telegram Канал
uz: Telegram Kanal

# subscribedToChannel
source: Did you subscribe to the Telegram channel?
ru: Вы подписались на Telegram канал?
uz: Telegram kanalga obuna bo'ldingizmi?

source: No
ru: Нет
uz: Yo'q

# yesSubscribed
source: Yes, I subscribed
ru: Да, подписался
uz: Ha, obuna bo'ldim

# subscribedToInstagram
source: Did you follow the Instagram page?
ru: Вы подписались на Instagram?
uz: Instagram sahifaga obuna bo'ldingizmi?

# taskCompletedQuestion
source: Did you complete the task?
ru: Вы выполнили задание?
uz: Vazifani bajardingizmi?

# shareAppText
source: TDM Training - the easiest way to earn UC! Download the app and collect coins!
ru: TDM Training - самый простой способ получить UC! Скачайте приложение и собирайте монеты!
uz: TDM Training - UC topishning eng oson yo'li! Bu ilovani yuklab oling va coin to'plang!

source: Share
ru: Поделиться
uz: Ulashish

# sharedApp
source: Did you share the app?
ru: Вы поделились приложением?
uz: Ilovani ulashdingizmi?

# adNotLoaded
source: Ad failed to load
ru: Реклама не загрузилась
uz: Reklama yuklanmadi

# taskTypeDailyBonus
source: Daily bonus
ru: Ежедневный бонус
uz: Kunlik bonus

# taskTypeInviteFriend
source: Invite friend
ru: Пригласить друга
uz: Do'st taklif

# taskTypeAd
source: Ad
ru: Реклама
uz: Reklama

# taskTypeGame
source: Game
ru: Игра
uz: O'yin

# taskTypeApp
source: App
ru: Приложение
uz: Ilova

# taskTypeShare
source: Share
ru: Поделиться
uz: Ulashish

# taskTypeRate
source: Rate
ru: Оценить
uz: Baholash

# todayProgress
source: Today's progress
ru: Прогресс за сегодня
uz: Bugungi progress

source: No tasks yet
ru: Заданий пока нет
uz: Hozircha vazifalar yo'q

# newTasksComingSoon
source: New tasks will be added soon
ru: Скоро появятся новые задания
uz: Tez orada yangi vazifalar qo'shiladi

source: Your referral code
ru: Ваш код приглашения
uz: Taklif kodingiz

source: Copy
ru: Копировать
uz: Nusxalash

# referralEarnInfo
source: Get +100 coins for each referral!
ru: Получите +100 монет за каждое приглашение!
uz: Har bir taklif uchun +100 coin oling!

# haveReferralCode
source: Have a referral code?
ru: Есть код приглашения?
uz: Taklif kodi bor?

source: Confirm
ru: Подтвердить
uz: Tasdiqlash

# referralEarnHint
source: Enter referral code and get +50 coins!
ru: Введите код приглашения и получите +50 монет!
uz: Taklif kodi kiritib +50 coin oling!

source: Enter 6-digit code
ru: Введите 6-значный код
uz: 6 belgili kod kiriting

# referralSuccess
source: +50 coins received! The referrer also got +100 coins.
ru: +50 монет получено! Пригласивший тоже получил +100 монет.
uz: +50 coin oldingiz! Taklif qiluvchi ham +100 coin oldi.

# referralCodeNotFound
source: Code not found or already used
ru: Код не найден или уже использован
uz: Kod topilmadi yoki allaqachon ishlatilgan

# taskCompleted
source: Completed
ru: Выполнено
uz: Bajarildi

# enterTelegramIdError
source: Enter Telegram ID
ru: Введите Telegram ID
uz: Telegram ID kiriting

source: Invalid ID format
ru: Неверный формат ID
uz: Noto'g'ri ID format

# subscribeFirst
source: Subscribe to the bot first and send /code command
ru: Сначала подпишитесь на бота и отправьте команду /code
uz: Avval botga obuna bo'ling va /code buyrug'ini yuboring

# serverError
source: Server connection error
ru: Ошибка подключения к серверу
uz: Server bilan bog'lanishda xatolik

# checkInternet
source: Check your internet connection
ru: Проверьте подключение к интернету
uz: Internet ulanishini tekshiring

source: Enter 4-digit code
ru: Введите 4-значный код
uz: 4 xonali kod kiriting

source: Wrong code
ru: Неверный код
uz: Noto'g'ri kod

# yesCompleted
source: Yes, I completed it
ru: Да, выполнил
uz: Ha, bajardim

# referralShareText
source: Download TDM Training and enter my referral code: {code} +50 coins for your friend, +100 coins for you!
ru: Скачайте TDM Training и введите мой код приглашения: {code} Вашему другу +50 монет, вам +100 монет!
uz: TDM Training ilovasini yuklab, mening taklif kodimni kiriting: {code} Do'stingiz uchun +50 coin, siz uchun +100 coin!

# sendCodeToBot
source: Send /code command to bot
ru: Отправьте боту команду /code
uz: Botga /code buyrug'ini yuboring

# ucShopBuyViaId
source: Buy UC via ID
ru: Покупайте UC через ID
uz: ID orqali UC sotib oling

# ucShopDesc
source: Make payment, upload receipt, UC will be sent after admin confirmation
ru: Оплатите, загрузите чек, после подтверждения админом UC будет отправлен
uz: To'lovni amalga oshiring, chekni yuklang, admin tasdiqlagandan so'ng UC yuboriladi

# ucPricesList
source: UC PRICES
ru: ЦЕНЫ НА UC
uz: UC NARXLARI

source: ORDER HISTORY
ru: ИСТОРИЯ ЗАКАЗОВ
uz: BUYURTMALAR TARIXI

source: No orders yet
ru: Заказов пока нет
uz: Hali buyurtma yo'q

# enterYourPubgId
source: Enter your ID
ru: Введите ваш ID
uz: ID raqamingizni kiriting

# selectImage
source: Select photo
ru: Выбрать фото
uz: Rasm tanlash
