Repository: Atomic002/Tdm-Training
Catalog: lib/l10n/app_*.arb
Languages: ru, uz

source: Camera
ru: Камера
uz: Kamera

source: Gallery
ru: Галерея
uz: Galereya

source: Receipt selected
ru: Чек выбран
uz: Chek tanlandi

# uploadReceipt
source: Upload receipt photo
ru: Загрузите фото чека
uz: Chek rasmini yuklang

# paymentNote
source: Upload payment receipt. UC will be sent after admin confirmation.
ru: Загрузите чек оплаты. UC будет отправлен после подтверждения админом.
uz: To'lov chekini yuklang. Admin tekshirib tasdiqlagandan so'ng UC yuboriladi.

# imageUploadFailed
source: Image upload failed. Please try again.
ru: Фото не загрузилось. Попробуйте снова.
uz: Rasm yuklanmadi. Qayta urinib ko'ring.

# orderAccepted
source: Order accepted! Admin will review.
ru: Заказ принят! Админ проверит.
uz: Buyurtma qabul qilindi! Admin tekshiradi.

source: Submitting...
ru: Отправка...
uz: Yuborilmoqda...

source: Place order
ru: Оформить заказ
uz: Buyurtma berish

# ucStatusPending
source: Awaiting receipt
ru: Ожидание чека
uz: Chek kutilmoqda

# ucStatusConfirmed
source: Receipt confirmed
ru: Чек подтверждён
uz: Chek tasdiqlandi

# ucStatusCompleted
source: Completed
ru: Выполнено
uz: Bajarildi

# ucStatusRejected
source: Rejected
ru: Отклонено
uz: Rad etildi

# ucStatusUnknown
source: Unknown
ru: Неизвестно
uz: Noma'lum

# som
source: UZS
ru: сум
uz: so'm

# priceSom
source: {price} UZS
ru: {price} сум
uz: {price} so'm

source: Daily Limit
ru: Дневной лимит
uz: Kunlik Limit

# dailyLimitReached
source: You've reached today's maximum game limit!
ru: Достигнут максимальный лимит игр на сегодня!
uz: Bugun maksimal o'yin soniga yetdingiz!

# dailyGameLimitInfo
source: You can play {count} times per day
ru: Можно играть {count} раз в день
uz: Kuniga {count} marta o'ynash mumkin

source: Try again tomorrow!
ru: Попробуйте завтра!
uz: Ertaga qayta urinib ko'ring!

# gamePreparingLoading
source: Preparing game...
ru: Подготовка к игре...
uz: O'yin tayyorlanmoqda...

# adFailedRetry
source: Ad failed to load. Please try again.
ru: Реклама не загрузилась. Попробуйте снова.
uz: Reklama yuklanmadi. Qayta urinib ko'ring.

# matchFinishedTitle
source: Match {number} Finished!
ru: Матч {number} завершён!
uz: Match {number} Tugadi!

# coinEarnedGame
source: +1 Coin earned!
ru: +1 монет получено!
uz: +1 Coin oldingiz!

# averageTimeLabel
source: Avg. time:
ru: Среднее время:
uz: O'rtacha vaqt:

# hitsLabel
source: Hits:
ru: Попадания:
uz: Tegganlar:

# missesLabel
source: Misses:
ru: Промахи:
uz: O'tkaziganlar:

# passedLabel
source: Passed:
ru: Пройдено:
uz: O'tganlar:

# crashedLabel
source: Crashed:
ru: Столкновения:
uz: Urilganlar:

# remainingMatchesInfo
source: You can play {count} more matches today
ru: Сегодня можно ещё {count} матч
uz: Bugun yana {count} match o'ynash mumkin

source: Next Match
ru: Следующий матч
uz: Keyingi Match

source: Tap to Jump!
ru: Нажмите, чтобы прыгнуть!

# passThroughPipes
source: Fly through the pipes
ru: Пролетайте через трубы
uz: Pipe'lardan o'tib boring

# timeLabel
source: Time:
ru: Время:
uz: Vaqt:

# targetsLabel
source: Targets:
ru: Мишени:
uz: Nishonlar:

# targetSmall
source: Small
ru: Маленькие
uz: Kichik

# targetLarge
source: Large
ru: Большие
uz: Katta

# matchLabel
source: Match {number}
ru: Матч {number}

# flappyModeMatch
source: Flappy Mode - Match {number}
ru: Flappy Mode - Матч {number}

# rewardCoins
source: +{coins} Coin
ru: +{coins} монет

# backToLevels
source: Levels
ru: Уровни
uz: Darajalar

# miniPubgDestroyEnemies
source: Destroy the enemies!
ru: Уничтожьте врагов!
uz: Dushmanlarni yo'q qiling!

# gamesLeftWarning
source: Only {count} games left!
ru: Осталось всего {count} игр!
uz: Faqat {count} ta o'yin qoldi!

source: Auto-fire
ru: Авто-стрельба
uz: Avto-otish

source: SELECT LEVEL
ru: ВЫБЕРИТЕ УРОВЕНЬ
uz: DARAJA TANLANG

# miniPubgEasyDesc
source: Slow enemies
ru: Медленные враги
uz: Sekin dushmanlar

# miniPubgMediumDesc
source: Faster movement
ru: Быстрее движение
uz: Tezroq harakat

# miniPubgHardDesc
source: Very fast enemies
ru: Очень быстрые враги
uz: Juda tez dushmanlar

source: Back
ru: Назад
uz: Orqaga

# killRewardInfo
source: 10+ kills = 1 Coin
ru: 10+ убийств = 1 Coin
uz: 10+ kill = 1 Coin

source: Remaining
ru: Осталось
uz: Qolgan

# gamesCount
source: {count} games
ru: {count} игр
uz: {count} o'yin

source: Wave {number}
ru: Волна {number}
uz: To'lqin {number}

# controlHintAutoFire
source: Swipe left-right
ru: Проведите влево-вправо
uz: Chapga-o'ngga suring

# controlHintManual
source: Swipe and tap
ru: Проведите и нажмите
uz: Suring va bosing

# gameOverTitle
source: GAME OVER!
ru: ИГРА ОКОНЧЕНА!
uz: O'YIN TUGADI!

source: Enemies
ru: Враги
uz: Dushmanlar

# accuracyShort
source: Accuracy
ru: Точность
uz: Aniqlik

# coinsEarnedLabel
source: COINS EARNED
ru: МОНЕТЫ ПОЛУЧЕНЫ
uz: COIN OLINDI

# menuButton
source: MENU
ru: МЕНЮ
uz: MENYU

source: PLAY AGAIN
ru: ИГРАТЬ СНОВА
uz: YANA O'YNASH

# promoCodeTitle
source: Telegram Bot Task
ru: Задание Telegram бота
uz: Telegram Bot Vazifa

# promoCodeDesc
source: Complete tasks in our Telegram bot and get a promo code!
ru: Выполните задания в нашем Telegram боте и получите промо-код!
uz: Telegram botimizda vazifalarni bajaring va promo kod oling!

source: Open Telegram Bot
ru: Открыть Telegram бот
uz: Telegram Botni ochish

source: Enter promo code
ru: Введите промо-код
uz: Promo kodni kiriting

# redeemCode
source: Redeem
ru: Активировать
uz: Tasdiqlash

# promoCodeSuccess
source: Congratulations! +{coins} coins added!
ru: Поздравляем! +{coins} монет добавлено!
uz: Tabriklaymiz! +{coins} coin qo'shildi!

# promoCodeInvalid
source: Promo code not found
ru: Промо-код не найден
uz: Promo kod topilmadi

# promoCodeUsed
source: This promo code has already been used
ru: Этот промо-код уже использован
uz: Bu promo kod allaqachon ishlatilgan

# promoCodeError
source: An error occurred. Please try again
ru: Произошла ошибка. Попробуйте ещё раз
uz: Xatolik yuz berdi. Qayta urinib ko'ring

# ucServiceBadge
source: 100% GENUINE AND REAL
ru: 100% ЧЕСТНО И РЕАЛЬНО
uz: 100% HALOL VA HAQIQIY

# ucServiceDesc2
source: Best UC service! Fast, reliable PUBG Mobile UC purchase at the lowest prices. All transactions are guaranteed.
ru: Лучший сервис UC! Быстрая, надёжная покупка PUBG Mobile UC по самым низким ценам. Все транзакции гарантированы.
uz: Eng yaxshi UC servis xizmati! Tez, ishonchli va arzon narxlarda PUBG Mobile UC xarid qiling. Barcha tranzaksiyalar kafolatlanadi.

# ucOrderViaTelegram
source: Order via Telegram
ru: Заказать через Telegram
uz: Telegram orqali buyurtma berish

# ucServiceFeature1
source: Fast delivery (5-30 minutes)
ru: Быстрая доставка (5-30 минут)
uz: Tez yetkazib berish (5-30 daqiqa)

# ucServiceFeature2
source: Lowest prices
ru: Самые низкие цены
uz: Eng arzon narxlar

# ucServiceFeature3
source: 24/7 support
ru: Поддержка 24/7
uz: 24/7 qo'llab-quvvatlash

# ucServiceFeature4
source: 100% secure transaction
ru: 100% безопасная транзакция
uz: 100% xavfsiz tranzaksiya
